import json
from RandomCoffee import RandomCoffee


def test1():
    RC = RandomCoffee()

    RC.user_preferences = {
        # math
        1: ['Однокурсники'],
        2: ['Однокурсники'],
        # SP
        3: ['Однокурсники'],
        4: ['Однокурсники'],
        # NOD
        5: ['Однокурсники'],
        6: ['Однокурсники'],
    }

    RC.id_to_fac = {
        1: 'Математика',
        2: 'Математика',
        3: 'Современное Программирование',
        4: 'Современное Программирование',
        5: 'Науки о Данных',
        6: 'Науки о Данных'
    }

    RC.type_of_user = {
        1: 'child',
        2: 'child',
        3: 'child',
        4: 'child',
        5: 'child',
        6: 'child',
    }

    RC.fac_to_ids = {
        'Математика': [1, 2],
        'Современное Программирование': [3, 4],
        'Науки о Данных': [5, 6]
    }

    return RC.get_pairs()


def test2():
    """
    No pairs for SP and NOD
    :return:
    """
    RC = RandomCoffee()

    RC.user_preferences = {
        # math
        1: ['Однокурсники'],
        2: ['Однокурсники'],
        3: ['Однокурсники'],
        4: ['Кураторы'],

        # SP
        5: ['Однокурсники'],
        6: ['Другое направление'],
        # NOD
        7: ['Однокурсники'],
        8: ['Другое направление'],
    }

    RC.id_to_fac = {
        1: 'Математика',
        2: 'Математика',
        3: 'Математика',
        4: 'Математика',
        5: 'Современное Программирование',
        6: 'Современное Программирование',
        7: 'Науки о Данных',
        8: 'Науки о Данных'
    }

    RC.type_of_user = {
        1: 'child',
        2: 'child',
        3: 'kurator',
        4: 'child',
        5: 'child',
        6: 'child',
        7: 'child',
        8: 'child',
    }

    RC.fac_to_ids = {
        'Математика': [1, 2, 3, 4],
        'Современное Программирование': [5, 6],
        'Науки о Данных': [7, 8]
    }

    return RC.get_pairs()


def test3():
    """
    No pairs for SP and NOD
    :return:
    """
    RC = RandomCoffee()

    RC.user_preferences = {
        # math
        1: ['Однокурсники'],
        2: ['Однокурсники', 'Кураторы'],
        3: ['Однокурсники', 'Кураторы'],
        4: ['Однокурсники'],
        5: ['Однокурсники', 'Другое направление', 'Кураторы'],
        6: ['Однокурсники', 'Другое направление', 'Кураторы'],
        7: ['Однокурсники', 'Другое направление'],
        8: ['Однокурсники'],
        9: ['Однокурсники'],
        10: ['Однокурсники'],
        # SP
        11: ['Однокурсники'],
        12: ['Другое направление'],
        13: ['Однокурсники', 'Другое направление', 'Кураторы'],
        14: ['Однокурсники', 'Кураторы'],
        15: ['Другое направление', 'Кураторы'],
        16: ['Кураторы'],
        17: ['Кураторы'],
        18: ['Кураторы'],
        19: ['Кураторы'],
        20: ['Однокурсники'],
        # NOD
        21: ['Однокурсники'],
        22: ['Другое направление'],
        23: ['Однокурсники', 'Другое направление', 'Кураторы'],
        24: ['Кураторы'],
        25: ['Однокурсники'],
        26: ['Однокурсники', 'Другое направление', 'Кураторы'],
        27: ['Однокурсники', 'Кураторы'],
        28: ['Однокурсники'],
        29: ['Однокурсники'],
        30: ['Однокурсники']
    }

    RC.id_to_fac = {
        1: 'Математика',
        2: 'Математика',
        3: 'Математика',
        4: 'Математика',
        5: 'Математика',
        6: 'Математика',
        7: 'Математика',
        8: 'Математика',
        9: 'Математика',
        10: 'Математика',
        11: 'Современное Программирование',
        12: 'Современное Программирование',
        13: 'Современное Программирование',
        14: 'Современное Программирование',
        15: 'Современное Программирование',
        16: 'Современное Программирование',
        17: 'Современное Программирование',
        18: 'Современное Программирование',
        19: 'Современное Программирование',
        20: 'Современное Программирование',
        21: 'Науки о Данных',
        22: 'Науки о Данных',
        23: 'Науки о Данных',
        24: 'Науки о Данных',
        25: 'Науки о Данных',
        26: 'Науки о Данных',
        27: 'Науки о Данных',
        28: 'Науки о Данных',
        29: 'Науки о Данных',
        30: 'Науки о Данных'
    }

    RC.type_of_user = {
        1: 'child',
        2: 'child',
        3: 'child',
        4: 'child',
        5: 'child',
        6: 'child',
        7: 'child',
        8: 'kurator',
        9: 'kurator',
        10: 'kurator',
        11: 'child',
        12: 'child',
        13: 'child',
        14: 'child',
        15: 'child',
        16: 'child',
        17: 'child',
        18: 'child',
        19: 'child',
        20: 'kurator',
        21: 'child',
        22: 'child',
        23: 'child',
        24: 'child',
        25: 'child',
        26: 'child',
        27: 'child',
        28: 'kurator',
        29: 'kurator',
        30: 'kurator'
    }

    RC.fac_to_ids = {
        'Математика': [1, 2, 3, 4, 5, 6, 7, 8, 10],
        'Современное Программирование': [11, 12, 13, 14, 15, 16, 17, 18, 19, 20],
        'Науки о Данных': [21, 22, 23, 24, 25, 26, 27, 28, 29, 30]
    }

    return RC.get_pairs()


if __name__ == "__main__":
    print("TEST 1")
    pairs = test1()[0]
    print('\tnow:  ' + str(pairs))
    print('\tmust: [[1, 2], [3, 4], [5, 6]]')

    print("TEST 2")
    pairs, not_found = test2()
    print('\tnow:  ' + str(pairs))
    print('\tmust: [[1, 2], [3, 4], [6, 8]]')
    print()
    print('\tnot found: ' + str(not_found))
    print('\tmight be:  [7, 5]')

    print("TEST 3")
    pairs, not_found = test3()
    print('\tnow:  ' + str(pairs))
    print('\tmust: [[1, 4], [21, 25], [19, 20], [17, 20], [16, 20], [24, 30], [6, 2], [7, 3], [13, 14], [23, 26], [12, 5], [15, 22], [5, 8], [27, 28]]')
    print()
    print('\tnot found: ' + str(not_found))
    print('\tmight be: hehehe')
